{
    "intro": {
        "about": [
            "Chào bạn ! Mình là Vũ Văn Luân, Senior Web Developer. 4 năm kinh nghiệm lập trình web, tất cả đều dùng Java, lại được tham gia hầu hết các giai đoạn của chu kỳ phát triển dự án web, đã từng dựng base nhiều dự án. Tuy vẫn còn rất nhiều mảng trong J2EE chưa có cơ hội thử sức, nhưng vẫn rất tự tin có thể làm việc tốt. Mình cũng vừa thi đỗ chứng chỉ OCAJP 8 và OCPJP 8, dự định trong vài năm tới sẽ cố gắng thử sức với chứng chỉ OCM.",
            "Ngoài Java web, mình cũng khá hứng thú và có tìm hiểu qua futter, python, javascript và swift. Những lúc nhàn rỗi, mình rất thích code python. Truớc có thử Django và mình cực phấn khích với nó. Hiện vẫn còn vài project Django trên github. Ngoài ra cũng hay viết những script bằng python để crawl data, edit file, upload ảnh,...",
            "Javascript thì cũng thử code ReactJs và React Native. ReactJs cũng khá hay, nhưng việc can thiệp quá nhiều HTML(thực tế là làm gì còn file HTML) lại không phải điều mình mong đợi. React Native thì thực sự là một trải nghiệm ...không vui vẻ gì. Ý tưởng rất hay, cách code quen thuộc, nhưng Performance tệ, code liên tục lỗi(không phải lỗi của mình) làm mình cực khó chịu, vậy nên \"say good bye\" luôn.",
            "Code chán quá rồi, cũng rảnh rỗi nên \"đá\" architecture. Mình hiện cũng đang có chứng chỉ AWS Certified Solutions Architect - Professional và Certified IT Architect – Foundation (CITA-F)."
        ],
        "skills": [
            {
                "title": "Java",
                "value": "90"
            },
            {
                "title": "JavaScript",
                "value": "70"
            },
            {
                "title": "Spring",
                "value": "80"
            },
            {   
                "title": "Hibernate",
                "value": "85"
            },
            {
                "title": "Python",
                "value": "60"
            },
            {
                "title": "Django",
                "value": "60"
            },
            {
                "title": "Linux",
                "value": "80"
            },
            {
                "title": "Docker",
                "value": "60"
            },
            {
                "title": "Amazon Web Service",
                "value": "80"
            },
            {
                "title": "Docker",
                "value": "60"
            }
        ],
        "experiences": [
            {
                "date": "03/2018 - hiện nay",
                "address": "Công ty cổ phần V.N.E.X.T",
                "position": "Senior Java developer",
                "description": "Cảm thấy khoảng chững khi làm việc tại Rikkeisoft, lại thêm một số vấn đề khác nên mình rời Rikkeisoft. Những tưởng ở Rikkeisoft là khó khăn, sang bên V.N.E.X.T còn kinh khủng hơn. Mới chân ướt chân ráo bước ra ngoài xã hội đã bị vứt ngay vào dự án khó nhằn, lại còn bắt làm lead, chịu trách nhiệm tất cả kỹ thuật trong dự án. Khách hàng thì ngồi cạnh, cứ ba buổi một tuần lại lôi đi hỏi kỹ thuật, tình hình đến đâu rồi, sợ vãi linh hồn. Nhưng chính những điều đó đã giúp mình trưởng thành rất nhiều. Không còn anh lead để \"đứng mũi chịu xào\" cho dự án; luôn phải đối mặt với khách hàng(rất giỏi kỹ thuật), sự giúp đỡ về mặt tinh thần và vật chất của anh chị em, của các sếp là nguồn động lực rất lớn để mình học tập, trau dồi và hoàn thiện kiến thức không ngừng nghỉ."
            },
            {
                "date": "03/2015 - 03/2017",
                "address": "Công ty TNHH Rikkeisoft",
                "position": "Java developer",
                "description": "Sau khi rời VDC, mình chuyển sang Rikkeisoft và làm việc ở đây trong suốt 2 năm. Công việc ở đây là một thử thách với mình. Trừ anh lead thì tất cả dev trong team(trong đó có mình) đều rất trẻ, dự án build mới, dùng framework siêu khó và cũng không một ai biết đến. Những khó khăn về nguồn tài liệu, về người hỗ trợ đã làm mình và cả đội nhiều lần nản chí. Nhưng thử thách cũng lại là cơ hội!. Không có tài liệu, anh em cùng nhau mò mẫm, lục tung source code của framework lên để hiểu, từ đó cải thiện rất nhiều kỹ năng tự nghiên cứu và giải quyết vấn đề."
            },
            {
                "date": "07/2014 - 01/2015",
                "address": "Công ty điện toán và truyền số liệu (VDC)",
                "position": "Cộng tác viên",
                "description": "VDC là trải nghiệm đầu tiên của mình khi bước ra khỏi ghế nhà trường, và mình phải nói đó là một trải nghiệm rất tuyệt vời. Ở đây, mình thật sự choáng ngợp trước môi trường làm việc và những đàn anh, đàn chị nơi đây. Và mình, đã rất may mắn khi được làm việc tại đây, được các anh chị nơi đây đã chỉ dạy. Những kiến thức đó đã trở thành \"kim chỉ nam\" cho con đường lập trình viên của mình cho đến tận bây giờ. "
            }
        ],
        "educations": [
            {
                "date": "05/2020",
                "name": "Professional Certification - Professional Scrum Master I",
                "supplier": "Scrum.org",
                "desciption": ""
            },
            {
                "date": "05/2020",
                "name": "Oracle Certified Professional: Java SE 11 Developer",
                "supplier": "ORACLE",
                "desciption": ""
            },
            {
                "date": "12/2019",
                "name": "AWS Certified Solutions Architect - Professional",
                "supplier": "Amazon Web Services",
                "desciption": ""
            },
            {
                "date": "11/2018",
                "name": "Certified IT Architect – Foundation (CITA-F)",
                "supplier": "IASA Global",
                "desciption": ""
            },
            {
                "date": "06/2018",
                "name": "Oracle Certified Professional Java SE 8 Programmer II",
                "supplier": "ORACLE",
                "desciption": ""
            },
            {
                "date": "03/2018",
                "name": "Oracle Certified Associated Java SE 8 Programmer I",
                "supplier": "ORACLE",
                "desciption": ""
            },
            {
                "date": "2012 - 2014",
                "name": "Aptech Certified Computer Professional",
                "supplier": "HANOI APTECH",
                "desciption": ""
            },
            {
                "date": "2010 - 2014",
                "name": "Bachelor of Laws",
                "supplier": "HANOI LAW UNIVERSITY",
                "desciption": ""
            }
        ],
        "brands": [
            {
                "url": "https://swift.com/",
                "img": "brands/swift-200x200.webp",
                "title": "swift"
            },
            {
                "url": "#",
                "img": "brands/ai-200x200.webp",
                "title": "artificial intelligence"
            },
            {
                "url": "https://www.docker.com/",
                "img": "brands/docker-200x200.webp",
                "title": "docker"
            },
            {
                "url": "https://www.java.com/",
                "img": "brands/java-200x200.webp",
                "title": "java"
            },
            {
                "url": "https://www.python.org/",
                "img": "brands/python-200x200.webp",
                "title": "python"
            }
        ],
        "references": [
            {
                "name": "",
                "avatar": "",
                "work": "",
                "content": ""
            }
        ],
        "fun_description": [
            "Hiện nay mình làm việc khá nhiều với Spring/Spring Boot. Mình cũng đang nghiên cứu thêm Docker và Affiliate Intelligence. Microservice hay Big Data cũng là những trend mình khá hứng thú và sẽ tìm hiểu trong thời gian sắp tới."
        ]
    }
}