{
    "intro": {
        "about": [
            "I am a Java Technical Leader, an AWS Solution Architect with significant experience in building, desinging and consulting services to customers. In-depth knowledge of Java, Spring, Microservices and AWS Architecture."
            , "I help companies standanize project development technique by introducing new technologies, teaching, writing and consulting best practice, security methodologies."
            , "Love coding and research. Good at self-learning and would like to learn everything."
            ,"Why you should hate me? Stubborn! Usually arguing with leader, PM or PO because of preferring perfect user experience than deadline"
            ,"Why you should love me? Enthusiastic! I tend to help everyone no matter who they are. I would like to share my knowledge by writing, teaching and talking."
        ],
        "skills": [
            {
                "title": "Java",
                "value": "90"
            },
            {
                "title": "JavaScript",
                "value": "70"
            },
            {
                "title": "Spring",
                "value": "80"
            },
            {   
                "title": "Hibernate",
                "value": "85"
            },
            {
                "title": "Python",
                "value": "60"
            },
            {
                "title": "Django",
                "value": "60"
            },
            {
                "title": "Linux",
                "value": "80"
            },
            {
                "title": "Docker",
                "value": "60"
            },
            {
                "title": "Amazon Web Service",
                "value": "80"
            },
            {
                "title": "Docker",
                "value": "60"
            }
        ],
        "experiences": [
            {
                "date": "03/2018 - 04/2021",
                "address": "Công ty cổ phần V.N.E.X.T",
                "position": "Senior Java developer",
                "description": "Cảm thấy khoảng chững khi làm việc tại Rikkeisoft, lại thêm một số vấn đề khác nên mình rời Rikkeisoft. Những tưởng ở Rikkeisoft là khó khăn, sang bên V.N.E.X.T còn kinh khủng hơn. Mới chân ướt chân ráo bước ra ngoài xã hội đã bị vứt ngay vào dự án khó nhằn, lại còn bắt làm lead, chịu trách nhiệm tất cả kỹ thuật trong dự án. Khách hàng thì ngồi cạnh, cứ ba buổi một tuần lại lôi đi hỏi kỹ thuật, tình hình đến đâu rồi, sợ vãi linh hồn. Nhưng chính những điều đó đã giúp mình trưởng thành rất nhiều. Không còn anh lead để \"đứng mũi chịu xào\" cho dự án; luôn phải đối mặt với khách hàng(rất giỏi kỹ thuật), sự giúp đỡ về mặt tinh thần và vật chất của anh chị em, của các sếp là nguồn động lực rất lớn để mình học tập, trau dồi và hoàn thiện kiến thức không ngừng nghỉ."
            },
            {
                "date": "03/2015 - 03/2017",
                "address": "Công ty TNHH Rikkeisoft",
                "position": "Java developer",
                "description": "Sau khi rời VDC, mình chuyển sang Rikkeisoft và làm việc ở đây trong suốt 2 năm. Công việc ở đây là một thử thách với mình. Trừ anh lead thì tất cả dev trong team(trong đó có mình) đều rất trẻ, dự án build mới, dùng framework siêu khó và cũng không một ai biết đến. Những khó khăn về nguồn tài liệu, về người hỗ trợ đã làm mình và cả đội nhiều lần nản chí. Nhưng thử thách cũng lại là cơ hội!. Không có tài liệu, anh em cùng nhau mò mẫm, lục tung source code của framework lên để hiểu, từ đó cải thiện rất nhiều kỹ năng tự nghiên cứu và giải quyết vấn đề."
            },
            {
                "date": "07/2014 - 01/2015",
                "address": "Công ty điện toán và truyền số liệu (VDC)",
                "position": "Cộng tác viên",
                "description": "VDC là trải nghiệm đầu tiên của mình khi bước ra khỏi ghế nhà trường, và mình phải nói đó là một trải nghiệm rất tuyệt vời. Ở đây, mình thật sự choáng ngợp trước môi trường làm việc và những đàn anh, đàn chị nơi đây. Và mình, đã rất may mắn khi được làm việc tại đây, được các anh chị nơi đây đã chỉ dạy. Những kiến thức đó đã trở thành \"kim chỉ nam\" cho con đường lập trình viên của mình cho đến tận bây giờ. "
            }
        ],
        "educations": [
            {
                "date": "11/2020",
                "name": "AWS Certified Security – Specialty",
                "supplier": "Amazon Web Services",
                "desciption": ""
            },
            {
                "date": "05/2020",
                "name": "Professional Certification - Professional Scrum Master I",
                "supplier": "Scrum.org",
                "desciption": ""
            },
            {
                "date": "05/2020",
                "name": "Oracle Certified Professional: Java SE 11 Developer",
                "supplier": "ORACLE",
                "desciption": ""
            },
            {
                "date": "12/2019",
                "name": "AWS Certified Solutions Architect - Professional",
                "supplier": "Amazon Web Services",
                "desciption": ""
            },
            {
                "date": "11/2018",
                "name": "Certified IT Architect – Foundation (CITA-F)",
                "supplier": "IASA Global",
                "desciption": ""
            },
            {
                "date": "06/2018",
                "name": "Oracle Certified Professional Java SE 8 Programmer II",
                "supplier": "ORACLE",
                "desciption": ""
            },
            {
                "date": "03/2018",
                "name": "Oracle Certified Associated Java SE 8 Programmer I",
                "supplier": "ORACLE",
                "desciption": ""
            },
            {
                "date": "2012 - 2014",
                "name": "Aptech Certified Computer Professional",
                "supplier": "HANOI APTECH",
                "desciption": ""
            },
            {
                "date": "2010 - 2014",
                "name": "Bachelor of Laws",
                "supplier": "HANOI LAW UNIVERSITY",
                "desciption": ""
            }
        ],
        "brands": [
            {
                "url": "https://swift.com/",
                "img": "brands/swift-200x200.webp",
                "title": "swift"
            },
            {
                "url": "#",
                "img": "brands/ai-200x200.webp",
                "title": "artificial intelligence"
            },
            {
                "url": "https://www.docker.com/",
                "img": "brands/docker-200x200.webp",
                "title": "docker"
            },
            {
                "url": "https://www.java.com/",
                "img": "brands/java-200x200.webp",
                "title": "java"
            },
            {
                "url": "https://www.python.org/",
                "img": "brands/python-200x200.webp",
                "title": "python"
            }
        ],
        "references": [
            {
                "name": "",
                "avatar": "",
                "work": "",
                "content": ""
            }
        ],
        "fun_description": [
            "Hiện nay mình làm việc khá nhiều với Microservices .Cloud Computing và Affiliate Intelligence cũng là những trend mình khá hứng thú và sẽ tìm hiểu trong thời gian sắp tới."
        ]
    }
}